{"keras_version": "2.4.0", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "name": "conv2d_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Conv2D", "config": {"filters": 30, "padding": "valid", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activation": "relu", "strides": [1, 1], "bias_constraint": null, "name": "conv2d", "use_bias": true, "bias_regularizer": null, "groups": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [5, 5], "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 15, "padding": "valid", "dtype": "float32", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "activation": "relu", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "groups": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "trainable": true, "dtype": "float32", "name": "dropout", "noise_shape": null}}, {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "units": 128, "activity_regularizer": null, "name": "dense", "activation": "relu", "use_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "units": 50, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "use_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "units": 13, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "use_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}], "name": "sequential"}}